app/controllers/home_controller.rb

SELECT COUNT(*) FROM "products"
---
  def index
    @welcome_message = 'Ruby on Rails for beginners 2017'
    @msg = 'Web shop demo application'
    @broj = Product.count

SELECT "products".* FROM "products" ORDER BY "products"."price" DESC
---
  def products
  @products = Product.order(price: :desc)