app/controllers/home_controller.rb

  def products
  @products = Product.order("#{sort_column} #{sort_direction}")
---
SELECT "products".* FROM "products"